spec/support/mvi/add_person_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:MCCI_IN000002UV01 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/MCCI_IN000002UV01.xsd" xmlns="urn:hl7-org:v3" xmlns:idm="http://********">
      <id extension="WSDOC2002071405368870747096200" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20200207140538"/>
      <versionCode code="4.1"/>
      <interactionId extension="MCCI_IN000002UV01" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="200VGOV-40047fb4-02d3-4a7b-9cb9-a8cdf55d89cd" root="22a0f9e0-4454-11dc-a6be-3603d6866807"/>
        </targetMessage>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="111985523^PI^200BRLS^USVBA" displayName="IEN"/>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="32397028^PI^200CORP^USVBA" displayName="IEN"/>
        </acknowledgementDetail>
      </acknowledgement>
    </idm:MCCI_IN000002UV01>
  </env:Body>
</env:Envelope>
